/*
* 关于session
*     1.是什么？
*         标准来说，session指的是会话，但是我们常说的session，全称叫做session会话存储。
*
*     2.特点：
*         1.存在于服务端（相对cookie稍安全一些）
*         2.存储的是浏览器（客户端）和服务器沟通产生的一些数据
*
*     3.默认session存储于服务器的运行内存中，当服务器开启session会话存储之后，没来一次新的请求
*       都会开辟一块内存空间，用来保存当前会话所产生的数据（例子中的：盒子）。
*
*     4.工作流程：
*       --第一次请求时，服务器会开辟一块内存空间，用于保存浏览器和服务器交互产生的数据
*          将这一块空间内放置一个会话存储器（开启了一个session会话存储）并且对其进行编号。
*       --返回响应的时候，会自动给浏览器一个cookie，cookie里存储的是上一步session会话存储的编号
*       --第二次去请求服务器的时候，会自动携带着该网站cookie。
*       --服务器解析cookie里的内容，去和服务器所保存的session编码比对
*           cookie有效：进行一些进一步的逻辑
*           cookie无效：进行另外一些逻辑
*
*     备注：
*         1.一般来说session都配合这cookie使用
*         2.一般的服务器都会做session持久化，（避免因重启服务器导致用户还需要再次登录）
*
* */